import pandas as pd

df = pd.DataFrame({'部门': {0: '财务',1: '财务',2: '财务',3: '财务',4: '财务',5: '行政',6: '行政',7: '行政',8: '行政', 9: '行政',10: '行政',11: '后勤',12: '后勤',13: '后勤',14: '后勤',15: '后勤',16: '后勤',17: '后勤',18: '后勤',19: '后勤',20: '后勤',21: '后勤'},
 '订单号': {0: 'A',1: 'A',2: 'A',3: 'B',4: 'B',5: 'C',6: 'C',7: 'C',8: 'D',9: 'D',10: 'F',11: 'G',12: 'G',13: 'G',14: 'G',15: 'G',16: 'G',17: 'G',18: 'G',19: 'G',20: 'G', 21: 'G'},
 '金额': {0: 1,1: 9,2: 3,3: 4,4: 5,5: 1, 6: 2,7: 3, 8: 4,9: 5,10: 5,11: 3,12: 4,13: 5,14: 3,15: 4,16: 5,17: 3,18: 4, 19: 5,20: 3, 21: 4}})

df


ngroup = 1001

def f(x):
    global ngroup
    sum = 0
    for i in x:
        sum += i
        if sum > 10:
            ngroup += 1
            sum = i
        yield ngroup
    # 顺序到下一组时 增1
    ngroup += 1

df.assign(发票号 = df.groupby(['部门','订单号'],sort=False).agg(lambda x:list(f(x))).explode('金额').values)
